<img src='./img/intel-logo.jpg' width=50%, Fig1> 

# 판다스 기초강의
<font size=5><b>2.Pandas DataFrame<b></font>

<div align='right'>성  민  석 (Minsuk  Sung)</div>
<div align='right'>류  회  성 (Hoesung Ryu)</div>

<img src='./img/pandas-logo.png' width=50%, Fig2> 


---

<h1>강의목차<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#DataFrame-이란?" data-toc-modified-id="DataFrame-이란?-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>DataFrame 이란?</a></span></li><li><span><a href="#데이터프레임-생성" data-toc-modified-id="데이터프레임-생성-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>데이터프레임 생성</a></span><ul class="toc-item"><li><span><a href="#2차원-데이터-생성" data-toc-modified-id="2차원-데이터-생성-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>2차원 데이터 생성</a></span></li><li><span><a href="#로우-인덱스와-컬럼-인덱스-설정" data-toc-modified-id="로우-인덱스와-컬럼-인덱스-설정-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>로우 인덱스와 컬럼 인덱스 설정</a></span></li><li><span><a href="#한번에-데이터-프레임과-로우,인덱스-만들기" data-toc-modified-id="한번에-데이터-프레임과-로우,인덱스-만들기-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>한번에 데이터 프레임과 로우,인덱스 만들기</a></span></li><li><span><a href="#Transpose" data-toc-modified-id="Transpose-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Transpose</a></span></li><li><span><a href="#axes-:--행과-열-이름을-리스트로-반환" data-toc-modified-id="axes-:--행과-열-이름을-리스트로-반환-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>axes :  행과 열 이름을 리스트로 반환</a></span></li><li><span><a href="#dtypes-:-데이터-형태-반환" data-toc-modified-id="dtypes-:-데이터-형태-반환-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>dtypes : 데이터 형태 반환</a></span></li><li><span><a href="#shape-:-행과-열의-개수(차원)을-튜플로-반환" data-toc-modified-id="shape-:-행과-열의-개수(차원)을-튜플로-반환-2.7"><span class="toc-item-num">2.7&nbsp;&nbsp;</span>shape : 행과 열의 개수(차원)을 튜플로 반환</a></span></li><li><span><a href="#size-:-DataFrame의-원소의-개수를-반환" data-toc-modified-id="size-:-DataFrame의-원소의-개수를-반환-2.8"><span class="toc-item-num">2.8&nbsp;&nbsp;</span>size : DataFrame의 원소의 개수를 반환</a></span></li><li><span><a href="#index-:-데이터프레임의-인덱스를-리스트로-반환" data-toc-modified-id="index-:-데이터프레임의-인덱스를-리스트로-반환-2.9"><span class="toc-item-num">2.9&nbsp;&nbsp;</span>index : 데이터프레임의 인덱스를 리스트로 반환</a></span></li><li><span><a href="#columns-:-데이터프레임의-컬럼을-리스트로-반환" data-toc-modified-id="columns-:-데이터프레임의-컬럼을-리스트로-반환-2.10"><span class="toc-item-num">2.10&nbsp;&nbsp;</span>columns : 데이터프레임의 컬럼을 리스트로 반환</a></span></li><li><span><a href="#values-:-데이터프레임의-값들을-반환" data-toc-modified-id="values-:-데이터프레임의-값들을-반환-2.11"><span class="toc-item-num">2.11&nbsp;&nbsp;</span>values : 데이터프레임의 값들을 반환</a></span></li></ul></li><li><span><a href="#데이터프레임-조회하기" data-toc-modified-id="데이터프레임-조회하기-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>데이터프레임 조회하기</a></span><ul class="toc-item"><li><span><a href="#Lastname-조회하기" data-toc-modified-id="Lastname-조회하기-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Lastname 조회하기</a></span></li><li><span><a href="#name-조회하기" data-toc-modified-id="name-조회하기-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>name 조회하기</a></span></li><li><span><a href="#로우-인덱스로-접근하여-조회하기-(.ioc)" data-toc-modified-id="로우-인덱스로-접근하여-조회하기-(.ioc)-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>로우 인덱스로 접근하여 조회하기 (.ioc)</a></span></li><li><span><a href="#기본적으로--인덱싱을-하면-로우에-적용된다.-column-은-순서가-없다." data-toc-modified-id="기본적으로--인덱싱을-하면-로우에-적용된다.-column-은-순서가-없다.-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>기본적으로  인덱싱을 하면 로우에 적용된다. column 은 순서가 없다.</a></span></li><li><span><a href="#loc로-row데이터-접근하기" data-toc-modified-id="loc로-row데이터-접근하기-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>loc로 row데이터 접근하기</a></span></li><li><span><a href="#loc로-column데이터-접근하기" data-toc-modified-id="loc로-column데이터-접근하기-3.6"><span class="toc-item-num">3.6&nbsp;&nbsp;</span>loc로 column데이터 접근하기</a></span></li><li><span><a href="#조건-인덱싱" data-toc-modified-id="조건-인덱싱-3.7"><span class="toc-item-num">3.7&nbsp;&nbsp;</span>조건 인덱싱</a></span></li><li><span><a href="#데이터프레임에-새로운-컬럼-추가하기(1)" data-toc-modified-id="데이터프레임에-새로운-컬럼-추가하기(1)-3.8"><span class="toc-item-num">3.8&nbsp;&nbsp;</span>데이터프레임에 새로운 컬럼 추가하기(1)</a></span></li><li><span><a href="#데이터프레임에-새로운-컬럼-추가하기(2)" data-toc-modified-id="데이터프레임에-새로운-컬럼-추가하기(2)-3.9"><span class="toc-item-num">3.9&nbsp;&nbsp;</span>데이터프레임에 새로운 컬럼 추가하기(2)</a></span></li><li><span><a href="#데이터프레임-로우,-컬럼-삭제" data-toc-modified-id="데이터프레임-로우,-컬럼-삭제-3.10"><span class="toc-item-num">3.10&nbsp;&nbsp;</span>데이터프레임 로우, 컬럼 삭제</a></span></li><li><span><a href="#변경값-저장-하기(1)" data-toc-modified-id="변경값-저장-하기(1)-3.11"><span class="toc-item-num">3.11&nbsp;&nbsp;</span>변경값 저장 하기(1)</a></span></li><li><span><a href="#변경값-저장-하기(2)" data-toc-modified-id="변경값-저장-하기(2)-3.12"><span class="toc-item-num">3.12&nbsp;&nbsp;</span>변경값 저장 하기(2)</a></span></li></ul></li></ul></div>

## DataFrame 이란?

<img src='./img/DataFrame.png' width=150%, Fig2> 


## 데이터프레임 생성

1. 생성자 인자

    1. data : dataFrame에 저장할 데이터 (numpy ndarray, dict, DataFrame 등 여러 형태 가능)
    1. index : 행(row) 이름, 기본값 = 0부터 1씩 증가하는 정수
    1. columns : 열(column) 이름, 기본값 = 0부터 1씩 증가하는 정수
    1. dtype : 데이터 형태(type), 만약 지정하지 않으면 파이썬이 자동으로 값의 형태를 보고 결정
    1. copy : 입력 데이터를 복사할지 지정. 디폴트는 False 임. (복사할 거 아니면 메모리 관리 차원에서 디폴트인 False 설정 사용하면 됨)

### 2차원 데이터 생성

In [1]:
import pandas as pd

df1 = pd.DataFrame([
                    ['Hong', 'Gildong', 'Pyonyang', 21],
                    ['Sung', 'Munsuk', 'Seoul', 27],
                    ['Ryu', 'Hoesung', 'Jeju', 29],
                    ['Hwang', 'Jinha', 'Gyeonggi-do', 30]
                    ]
                    
                    )
print(df1.shape)
df1

Duplicate key in file '/Users/hwesungryu/.matplotlib/matplotlibrc' line #2.
Duplicate key in file '/Users/hwesungryu/.matplotlib/matplotlibrc' line #3.

(4, 4)

       0        1            2   3
0   Hong  Gildong     Pyonyang  21
1   Sung   Munsuk        Seoul  27
2    Ryu  Hoesung         Jeju  29
3  Hwang    Jinha  Gyeonggi-do  30

### 로우 인덱스와 컬럼 인덱스 설정

In [2]:
df1.index = ['1','2','3','4']
df1.columns = ['Last name', 'First name', 'City', 'Age']
df1

  Last name First name         City  Age
1      Hong    Gildong     Pyonyang   21
2      Sung     Munsuk        Seoul   27
3       Ryu    Hoesung         Jeju   29
4     Hwang      Jinha  Gyeonggi-do   30

### 한번에 데이터 프레임과 로우,인덱스 만들기

In [3]:
import pandas as pd
# 1. 2차원 데이터 생성
df = pd.DataFrame([
                    ['Hong', 'Gildong', 'Pyonyang', 21],
                    ['Sung', 'Munsuk', 'Seoul', 27],
                    ['Ryu', 'Hoesung', 'Jeju', 29],
                    ['Hwang', 'Jinha', 'Gyeonggi-do', 30]
                    ]
                    ,index = ['1','2','3','4']
                    ,columns = ['Last name', 'First name', 'City', 'Age']
                    )
print(df.shape)
df

(4, 4)

  Last name First name         City  Age
1      Hong    Gildong     Pyonyang   21
2      Sung     Munsuk        Seoul   27
3       Ryu    Hoesung         Jeju   29
4     Hwang      Jinha  Gyeonggi-do   30

### Transpose

In [4]:
df1.T

                   1       2        3            4
Last name       Hong    Sung      Ryu        Hwang
First name   Gildong  Munsuk  Hoesung        Jinha
City        Pyonyang   Seoul     Jeju  Gyeonggi-do
Age               21      27       29           30

### axes :  행과 열 이름을 리스트로 반환

In [5]:
df1.axes

[Index(['1', '2', '3', '4'], dtype='object'),
 Index(['Last name', 'First name', 'City', 'Age'], dtype='object')]

In [6]:
print(df1.axes[0]) # colum 
print(df1.axes[1]) # row

Index(['1', '2', '3', '4'], dtype='object')
Index(['Last name', 'First name', 'City', 'Age'], dtype='object')

### dtypes : 데이터 형태 반환

In [7]:
df1.dtypes

Last name     object
First name    object
City          object
Age            int64
dtype: object

### shape : 행과 열의 개수(차원)을 튜플로 반환

In [8]:
df1.shape

(4, 4)

### size : DataFrame의 원소의 개수를 반환

In [9]:
df1.size

16

### index : 데이터프레임의 인덱스를 리스트로 반환

In [10]:
df1.index

Index(['1', '2', '3', '4'], dtype='object')

### columns : 데이터프레임의 컬럼을 리스트로 반환

In [11]:
df1.columns

Index(['Last name', 'First name', 'City', 'Age'], dtype='object')

### values : 데이터프레임의 값들을 반환

In [12]:
df1.values

array([['Hong', 'Gildong', 'Pyonyang', 21],
       ['Sung', 'Munsuk', 'Seoul', 27],
       ['Ryu', 'Hoesung', 'Jeju', 29],
       ['Hwang', 'Jinha', 'Gyeonggi-do', 30]], dtype=object)

In [13]:
type(df1.values)

numpy.ndarray

## 데이터프레임 조회하기

<img src='./img/DataFrame.png' width=150%, Fig2> 


  **데이터프레임 조회 규칙 **
    
   1. 로우 인덱스는 숫자 슬라이싱이 되지만, 컬럼은 불가능하다. (컬럼은 순서 개념이 없음)
   1. 기본적으로 "컬럼"을 먼저 인덱싱한다. 

   1. cf) pandas loc acronym
        1. iloc = index-location
        1. loc =  location

In [14]:
import pandas as pd
# 1. 2차원 데이터 생성
df = pd.DataFrame([
                    ['Hong', 'Gildong', 'Pyonyang', 21],
                    ['Sung', 'Munsuk', 'Seoul', 27],
                    ['Ryu', 'Hoesung', 'Jeju', 29],
                    ['Hwang', 'Jinha', 'Gyeonggi-do', 30]
                    ]
                    ,index = ['1','2','3','4']
                    ,columns = ['Last name', 'First name', 'City', 'Age']
                    )
print(df.shape)
df

(4, 4)

  Last name First name         City  Age
1      Hong    Gildong     Pyonyang   21
2      Sung     Munsuk        Seoul   27
3       Ryu    Hoesung         Jeju   29
4     Hwang      Jinha  Gyeonggi-do   30

### Lastname 조회하기

In [15]:
df1['Last name']

1     Hong
2     Sung
3      Ryu
4    Hwang
Name: Last name, dtype: object

### name 조회하기

In [16]:
# 2개 이상의 컬럼을 처리할때에는 [[]]를 사용 한다
df1[['Last name','First name']]

  Last name First name
1      Hong    Gildong
2      Sung     Munsuk
3       Ryu    Hoesung
4     Hwang      Jinha

### 로우 인덱스로 접근하여 조회하기 (.ioc)

In [17]:
# iloc 위치로 접근 하려할때 사용한다. 
# 2번째 row 를 불러온다
df.iloc[1]

Last name       Sung
First name    Munsuk
City           Seoul
Age               27
Name: 2, dtype: object

### 기본적으로  인덱싱을 하면 로우에 적용된다. column 은 순서가 없다.

In [18]:
# 기본적으로  인덱싱을 하면 로우에 적용된다. column 은 순서가 없다. 
# 2번쨰부터 4번째까지 조회 
df1[1:4]

  Last name First name         City  Age
2      Sung     Munsuk        Seoul   27
3       Ryu    Hoesung         Jeju   29
4     Hwang      Jinha  Gyeonggi-do   30

### loc로 row데이터 접근하기

In [19]:
# row 라는것을 loc로 명시해준다. 
df1.loc[['1','2','3']]

  Last name First name      City  Age
1      Hong    Gildong  Pyonyang   21
2      Sung     Munsuk     Seoul   27
3       Ryu    Hoesung      Jeju   29

### loc로 column데이터 접근하기

In [20]:
# 모든 row를 불러오고 싶을때 : 을 사용한다. 
df1.loc[:,['City','Age']]

          City  Age
1     Pyonyang   21
2        Seoul   27
3         Jeju   29
4  Gyeonggi-do   30

### 조건 인덱싱

In [21]:
# Age가 25보다 큰 것만 조회하기 
df1[df1['Age']>25]

  Last name First name         City  Age
2      Sung     Munsuk        Seoul   27
3       Ryu    Hoesung         Jeju   29
4     Hwang      Jinha  Gyeonggi-do   30

### 데이터프레임에 새로운 컬럼 추가하기(1)

In [22]:
df1['Math_Score'] = [90,99,100,97]
df1['English_Score'] = [100,99,90,96]
df1

  Last name First name         City  Age  Math_Score  English_Score
1      Hong    Gildong     Pyonyang   21          90            100
2      Sung     Munsuk        Seoul   27          99             99
3       Ryu    Hoesung         Jeju   29         100             90
4     Hwang      Jinha  Gyeonggi-do   30          97             96

### 데이터프레임에 새로운 컬럼 추가하기(2)

In [23]:
df1['Sum_Score'] = df1['Math_Score'] + df1['English_Score']
df1

  Last name First name         City  Age  Math_Score  English_Score  Sum_Score
1      Hong    Gildong     Pyonyang   21          90            100        190
2      Sung     Munsuk        Seoul   27          99             99        198
3       Ryu    Hoesung         Jeju   29         100             90        190
4     Hwang      Jinha  Gyeonggi-do   30          97             96        193

### 데이터프레임 로우, 컬럼 삭제

In [24]:
# .copy() :원본을 카피하는 명령어 
df = df1.copy()
df

  Last name First name         City  Age  Math_Score  English_Score  Sum_Score
1      Hong    Gildong     Pyonyang   21          90            100        190
2      Sung     Munsuk        Seoul   27          99             99        198
3       Ryu    Hoesung         Jeju   29         100             90        190
4     Hwang      Jinha  Gyeonggi-do   30          97             96        193

In [25]:
# index 가 4인 로우 삭제 
# axis=0이란 로우를 뜻한다
df.drop('4', axis=0)

  Last name First name      City  Age  Math_Score  English_Score  Sum_Score
1      Hong    Gildong  Pyonyang   21          90            100        190
2      Sung     Munsuk     Seoul   27          99             99        198
3       Ryu    Hoesung      Jeju   29         100             90        190

In [26]:
# 'city' 컬럼 삭제
# axis=1 이란 컬럼을 뜻한다.
df.drop('City', 1)

  Last name First name  Age  Math_Score  English_Score  Sum_Score
1      Hong    Gildong   21          90            100        190
2      Sung     Munsuk   27          99             99        198
3       Ryu    Hoesung   29         100             90        190
4     Hwang      Jinha   30          97             96        193

### 변경값 저장 하기(1)

In [27]:
# 원본 변경을 위해서는 다시 변수에 할당해야 함. 
df = df.drop('City', axis=1)
df

  Last name First name  Age  Math_Score  English_Score  Sum_Score
1      Hong    Gildong   21          90            100        190
2      Sung     Munsuk   27          99             99        198
3       Ryu    Hoesung   29         100             90        190
4     Hwang      Jinha   30          97             96        193

### 변경값 저장 하기(2)

In [28]:
df.drop('4', axis=0, inplace=True)
df

  Last name First name  Age  Math_Score  English_Score  Sum_Score
1      Hong    Gildong   21          90            100        190
2      Sung     Munsuk   27          99             99        198
3       Ryu    Hoesung   29         100             90        190